In [1]:
import pandas as pd

In [2]:
employee = {
    "ali_amini" : {
        "name" : "ali amini",
        "age" : 24,
        "pID" : "0987654321",
        "tel" : "98765456"
    },
    "reza_kaviani" : {
        "name" : {
            "fname" : "reza",
            "lname" : "kaviani"},
        "age" : 30,
        "pID" : "1234567800",
        "tel" : {
            "mobile" : "09123456789",
            "phone" : {
                "home" : "098765432",
                "work" : "987654345"
            }
        }
    }
}

In [3]:
df = pd.DataFrame(employee)
df

       ali_amini                                       reza_kaviani
name   ali amini              {'fname': 'reza', 'lname': 'kaviani'}
age           24                                                 30
pID   0987654321                                         1234567800
tel     98765456  {'mobile': '09123456789', 'phone': {'home': '0...